<template>
  <div style="display: flex;justify-content: center;">
    <el-card style="max-width: 900px;text-align: center;">
      <template #header><h1 style="text-align: center;font-size: 40px;">Описание сервиса</h1></template>
      <p style="font-size: 20px">
        Создание QR-кодов стало неотъемлемой частью современного мира, где обмен
        информацией и доступ к данным должны быть быстрыми и удобными. Наш
        сервис для создания QR-кодов предлагает пользователям простой и
        эффективный способ генерации уникальных кодов, которые могут быть
        настроены в зависимости от ваших нужд. Независимо от того, используете
        ли вы QR-коды для бизнеса, мероприятий, или личных нужд, наш инструмент
        поможет вам сделать это быстро и легко.
      </p>
      <hr />
      <p style="font-size: 20px">
        Наш сервис позволяет вам создавать QR-коды для различных целей, включая
        ссылки на веб-сайты, акции, контакты, Wi-Fi доступ и многое другое.
        Процесс создания QR-кода интуитивно прост: просто введите необходимую
        информацию, выберите желаемые настройки, такие как цвет и размер, и
        приложение автоматически сгенерирует QR-код.
      </p>
    </el-card>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped>
</style>
