<template>
  <div style="display: flex; justify-content: center">
    <el-card style="max-width: 900px" class="main__card">
      <template #header
        ><h1 style="text-align: center; font-size: 40px">
          Как это работает
        </h1></template
      >
      <p>
        1. Необходимо перейти на вклдку с созданием QR-кода, она находиться на
        навигационной панели с надписью "Create" или перейти по
        <nuxt-link class="navRef" to="/create" style="font-size: 20px;">ссылке</nuxt-link>
      </p>
      <p>
        2. На стринице представлен базовый QR-код который ведет на главуню
        страницу фейсбука, можете проверить это открыв на телефоне камеру и
        поднести ее к QR-коду.
      </p>
      <p>
        3. Справа от QR-кода представлены настройки для кастомизации вашего
        QR-кода, нажимая на любую из вкладок в этом меню, открвается форма,
        каждая из которых подписана за что она отвечает.
      </p>
      <p>
        4. После открыти нужной вам формы стилизации, вам доступна стилизация
        определенных параметров QR-кода,например так в форме 'Main Options', вам
        представлена стилизация ссылки на которую будет вести ваш QR-код, будь
        то сайт вашей кофейни, контакты, или WIFI доступ, или же вы можете
        вставить логитип вашей огранизации, для этого необходимо выбрать
        картинку которая загружена у вас на компьютере или телефоне, так
        картинка появиться по середине QR-кода.
      </p>
      <p>
        5. После того как вы закончили редактировать QR-код, необходимо выбрать
        формат скачивания и нажать конпку Download, выбрать папку для сохранения
        и ваш QR-код будет загружен
      </p>
      <p>
        6. Ниже представленые примеры где можно использовать ваш уникальный
        QR-код.
      </p>
    </el-card>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped>
.main__card p {
  font-size: 20px;
}
</style>
